Repository: Epiphany-Leon/LifeOS
Catalog: NexaLife/Localizable.xcstrings
Source language: en
Languages: zh_hans

# preferences.ai.model
source: Model
zh_hans: 模型

# preferences.ai.provider
source: Provider
zh_hans: 服务商

# preferences.ai.provider.qwen
source: Qwen
zh_hans: 通义千问 Qwen

# preferences.ai.section.provider
source: AI
zh_hans: AI 设置

# preferences.ai.test
source: Test Connection
zh_hans: 测试连接

# preferences.ai.test.failure
source: Test failed. Check API key, model, timeout, and network.
zh_hans: 测试失败，请检查 API Key、模型、超时与网络。

# preferences.ai.test.success
source: Connection test passed.
zh_hans: 连接测试通过。

# preferences.ai.timeout
source: Timeout
zh_hans: 超时

# preferences.appearance.dark
source: Dark
zh_hans: 深色

# preferences.appearance.light
source: Light
zh_hans: 浅色

# preferences.appearance.system
source: Follow System
zh_hans: 跟随系统

# preferences.backup.daily
source: Daily
zh_hans: 每天

# preferences.backup.off
source: Off
zh_hans: 关闭

# preferences.backup.weekly
source: Weekly
zh_hans: 每周

# preferences.common.saved
source: Saved
zh_hans: 已保存

# preferences.data.backup_frequency
source: Auto Backup Frequency
zh_hans: 自动备份频率

# preferences.data.change_directory
source: Change Data Folder…
zh_hans: 更改存储文件夹…

# preferences.data.directory
source: Data Directory
zh_hans: 数据目录

# preferences.data.export
source: Export Backup
zh_hans: 导出备份

# preferences.data.export.failure
source: Export failed:
zh_hans: 导出失败：

# preferences.data.export.success
source: Exported backup to:
zh_hans: 已导出备份到：

# preferences.data.fresh_start.clear_content
source: Clear Content
zh_hans: 清空内容

# preferences.data.fresh_start.clear_content.confirm.message
source: This removes local records and keeps your account.
zh_hans: 会清空本地记录，但保留当前账号信息。

# preferences.data.fresh_start.clear_content.confirm.title
source: Clear all local content?
zh_hans: 确认清空本地内容？

# preferences.data.fresh_start.clear_success
source: Local content has been cleared.
zh_hans: 本地内容已清空。

# preferences.data.fresh_start.delete_account
source: Delete Account
zh_hans: 删除账号

# preferences.data.fresh_start.delete_account.confirm.message
source: This clears local data, API token, and profile, then returns to onboarding.
zh_hans: 会清空本地数据、API Token 与个人资料，并回到首次引导。

# preferences.data.fresh_start.delete_account.confirm.title
source: Delete account and all local content?
zh_hans: 确认删除账号与全部本地内容？

# preferences.data.fresh_start.delete_success
source: Account deleted and local content cleared.
zh_hans: 账号已删除，本地内容已清空。

# preferences.data.fresh_start.partial_failure
source: Some operations failed:
zh_hans: 部分操作失败：

# preferences.data.fresh_start.restart_hint
source: Please restart the app to fully refresh all data handles.
zh_hans: 建议重启应用，确保数据句柄完全刷新。

# preferences.data.fresh_start.tagline
source: When needed, clear old traces and begin again.
zh_hans: 当你需要时，可以清空旧痕，让生活从此页重写。

# preferences.data.import
source: Import Backup
zh_hans: 导入备份

# preferences.data.import.error.empty_source
source: Selected import folder is empty.
zh_hans: 所选导入文件夹为空。

# preferences.data.import.failure
source: Import failed:
zh_hans: 导入失败：

# preferences.data.import.failure.rollback
source: Import failed and rollback failed:
zh_hans: 导入失败且回滚失败：

# preferences.data.import.failure.rolled_back
source: Import failed. Rolled back to previous data:
zh_hans: 导入失败，已回滚到旧数据：

# preferences.data.import.success
source: Imported backup into active data directory.
zh_hans: 已将备份导入当前数据目录。

# preferences.data.repair
source: Repair Data
zh_hans: 修复数据

# preferences.data.repair.avatar_reset
source: Invalid avatar path was reset.
zh_hans: 无效头像路径已重置。

# preferences.data.repair.directory_created
source: Data directory ensured.
zh_hans: 数据目录已确保存在。

# preferences.data.repair.failure
source: Repair failed:
zh_hans: 修复失败：

# preferences.data.repair.noop
source: No repairs were needed.
zh_hans: 未发现需要修复的项目。

# preferences.data.repair.timeout_reset
source: AI timeout was reset to 30 seconds.
zh_hans: AI 超时已重置为 30 秒。

# preferences.data.section.backup
source: Backup & Migration
zh_hans: 备份与迁移

# preferences.data.section.fresh_start
source: Clear The Past, Start Anew
zh_hans: 清空过去，重新开始

# preferences.data.section.integrity
source: Validation & Repair
zh_hans: 校验与修复

# preferences.data.section.storage
source: Storage
zh_hans: 存储

# preferences.data.validate
source: Validate Data
zh_hans: 校验数据

# preferences.data.validation.avatar_missing
source: Avatar file is missing.
zh_hans: 头像文件不存在。

# preferences.data.validation.missing_directory
source: Data directory does not exist.
zh_hans: 数据目录不存在。

# preferences.data.validation.not_readable
source: Data directory is not readable.
zh_hans: 数据目录不可读。

# preferences.data.validation.not_writable
source: Data directory is not writable.
zh_hans: 数据目录不可写。

# preferences.data.validation.ok
source: Validation passed. No blocking issues found.
zh_hans: 校验通过，未发现阻塞问题。

# preferences.language.system
source: Follow System
zh_hans: 跟随系统

# preferences.language.zh
source: Simplified Chinese
zh_hans: 简体中文

# preferences.localization.appearance
source: Appearance
zh_hans: 外观

# preferences.localization.language
source: Language
zh_hans: 语言

# preferences.log.debug
source: Debug
zh_hans: 调试

# preferences.log.error
source: Error
zh_hans: 错误

# preferences.log.info
source: Info
zh_hans: 信息

# preferences.log.warning
source: Warning
zh_hans: 警告

# preferences.module.dashboard
source: Dashboard
zh_hans: 仪表盘

# preferences.module.execution
source: Execution
zh_hans: 执行

# preferences.module.inbox
source: Inbox
zh_hans: 收件箱

# preferences.module.knowledge
source: Knowledge
zh_hans: 知识

# preferences.module.lifestyle
source: Lifestyle
zh_hans: 生活

# preferences.module.vitals
source: Vitals
zh_hans: 觉知

# preferences.privacy.clear_cache
source: Clear Cache
zh_hans: 清理缓存

# preferences.privacy.clear_cache.failure
source: Failed to clear cache:
zh_hans: 清理缓存失败：

# preferences.privacy.clear_cache.success
source: Cache cleared.
zh_hans: 缓存已清理。

# preferences.privacy.crash_reports
source: Allow crash reports
zh_hans: 允许崩溃报告

# preferences.privacy.log_level
source: Log Level
zh_hans: 日志级别

# preferences.privacy.section
source: Privacy & Security
zh_hans: 隐私与安全

# preferences.profile.nickname
source: Nickname
zh_hans: 昵称

# preferences.profile.nickname.placeholder
source: Your name
zh_hans: 你的昵称

# preferences.section.localization
source: Language & Appearance
zh_hans: 语言与外观

# preferences.section.profile
source: Profile
zh_hans: 个人资料

# preferences.section.startup
source: Startup
zh_hans: 启动

# preferences.shortcuts.global_search
source: Global Search
zh_hans: 全局搜索

# preferences.shortcuts.hint
source: Shortcut changes apply immediately to command menu and toolbar.
zh_hans: 快捷键修改会立即应用到菜单和工具栏。

# preferences.shortcuts.quick_capture
source: Quick Capture
zh_hans: 快速收集

# preferences.shortcuts.section
source: Keyboard Shortcuts
zh_hans: 快捷键

# preferences.startup.module
source: Default Module on Launch
zh_hans: 启动默认模块

# preferences.tab.data
source: Data
zh_hans: 数据

# preferences.tab.general
source: General
zh_hans: 通用

# preferences.tab.privacy
source: Privacy
zh_hans: 隐私

# preferences.tab.shortcuts
source: Shortcuts
zh_hans: 快捷键

# preferences.token.copied
source: Copied
zh_hans: 已复制

# preferences.token.copy_hint
source: Click to copy
zh_hans: 点击复制

# preferences.token.local_file
source: Local File
zh_hans: 本地文件

# preferences.token.mode.keychain
source: System Keychain
zh_hans: 系统钥匙串

# preferences.token.mode.local
source: Local File
zh_hans: 本地文件

# preferences.token.not_saved
source: Not Saved
zh_hans: 未保存

# preferences.token.pick_file
source: Choose File…
zh_hans: 选择文件…

# preferences.token.save
source: Save API Key
zh_hans: 保存 API Key

# preferences.token.saved
source: Saved Token
zh_hans: 已保存 Token

# preferences.token.storage_location
source: Storage Location
zh_hans: 实际保存地

# preferences.token.storage_mode
source: Storage Mode
zh_hans: 保存位置

# preferences.token.update
source: Update Token
zh_hans: 更新 Token

# settings.commands.global_search
source: Global Search
zh_hans: 全局搜索

# settings.commands.quick_actions
source: Quick Actions
zh_hans: 快捷操作

# settings.commands.quick_capture
source: Quick Capture
zh_hans: 快速收集

# settings.global_search.close
source: Close
zh_hans: 关闭

# settings.global_search.placeholder
source: Search modules
zh_hans: 搜索模块

# settings.global_search.title
source: Global Search
zh_hans: 全局搜索
